cfd/FILTER_H13/CASE_M/system/blockMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }

convertToMeters 0.001;
vertices
(
(0 100 150)
(10 100 150)
(10 103.5 150)
(0 103.5 150)
(0 100 203.5)
(10 100 203.5)
(10 103.5 203.5)
(0 103.5 203.5)
(0 100 450)
(10 100 450)
(10 103.5 450)
(0 103.5 450)
(0 100 650)
(10 100 650)
(10 103.5 650)
(0 103.5 650)
(0 100 796.5)
(10 100 796.5)
(10 103.5 796.5)
(0 103.5 796.5)
(0 100 850)
(10 100 850)
(10 103.5 850)
(0 103.5 850)
(10 150 150)
(0 150 150)
(10 150 203.5)
(0 150 203.5)
(10 150 450)
(0 150 450)
(10 150 650)
(0 150 650)
(10 150 796.5)
(0 150 796.5)
(10 150 850)
(0 150 850)
(10 650 150)
(0 650 150)
(10 650 203.5)
(0 650 203.5)
(10 650 450)
(0 650 450)
(10 650 650)
(0 650 650)
(10 650 796.5)
(0 650 796.5)
(10 650 850)
(0 650 850)
(10 696.5 150)
(0 696.5 150)
(10 696.5 203.5)
(0 696.5 203.5)
(10 696.5 450)
(0 696.5 450)
(10 696.5 650)
(0 696.5 650)
(10 696.5 796.5)
(0 696.5 796.5)
(10 696.5 850)
(0 696.5 850)
(10 700 150)
(0 700 150)
(10 700 203.5)
(0 700 203.5)
(10 700 450)
(0 700 450)
(10 700 650)
(0 700 650)
(10 700 796.5)
(0 700 796.5)
(10 700 850)
(0 700 850)
(150 100 150)
(150 103.5 150)
(150 100 203.5)
(150 103.5 203.5)
(150 100 450)
(150 103.5 450)
(150 100 650)
(150 103.5 650)
(150 100 796.5)
(150 103.5 796.5)
(150 100 850)
(150 103.5 850)
(150 150 150)
(150 150 203.5)
(150 150 450)
(150 150 650)
(150 150 796.5)
(150 150 850)
(150 650 150)
(150 650 203.5)
(150 650 450)
(150 650 650)
(150 650 796.5)
(150 650 850)
(150 696.5 150)
(150 696.5 203.5)
(150 696.5 450)
...
);
blocks
(
hex (0 1 2 3 4 5 6 7) AIR_INLET (1 1 3) simpleGrading (1 1 1)
hex (4 5 6 7 8 9 10 11) AIR_INLET (1 1 13) simpleGrading (1 1 1)
hex (8 9 10 11 12 13 14 15) AIR_INLET (1 1 10) simpleGrading (1 1 1)
hex (12 13 14 15 16 17 18 19) AIR_INLET (1 1 8) simpleGrading (1 1 1)
hex (16 17 18 19 20 21 22 23) AIR_INLET (1 1 3) simpleGrading (1 1 1)
hex (3 2 24 25 7 6 26 27) AIR_INLET (1 3 3) simpleGrading (1 1 1)
hex (7 6 26 27 11 10 28 29) AIR_INLET (1 3 13) simpleGrading (1 1 1)
hex (11 10 28 29 15 14 30 31) AIR_INLET (1 3 10) simpleGrading (1 1 1)
hex (15 14 30 31 19 18 32 33) AIR_INLET (1 3 8) simpleGrading (1 1 1)
hex (19 18 32 33 23 22 34 35) AIR_INLET (1 3 3) simpleGrading (1 1 1)
hex (25 24 36 37 27 26 38 39) AIR_INLET (1 25 3) simpleGrading (1 1 1)
hex (27 26 38 39 29 28 40 41) AIR_INLET (1 25 13) simpleGrading (1 1 1)
hex (29 28 40 41 31 30 42 43) AIR_INLET (1 25 10) simpleGrading (1 1 1)
hex (31 30 42 43 33 32 44 45) AIR_INLET (1 25 8) simpleGrading (1 1 1)
hex (33 32 44 45 35 34 46 47) AIR_INLET (1 25 3) simpleGrading (1 1 1)
hex (37 36 48 49 39 38 50 51) AIR_INLET (1 3 3) simpleGrading (1 1 1)
hex (39 38 50 51 41 40 52 53) AIR_INLET (1 3 13) simpleGrading (1 1 1)
hex (41 40 52 53 43 42 54 55) AIR_INLET (1 3 10) simpleGrading (1 1 1)
hex (43 42 54 55 45 44 56 57) AIR_INLET (1 3 8) simpleGrading (1 1 1)
hex (45 44 56 57 47 46 58 59) AIR_INLET (1 3 3) simpleGrading (1 1 1)
hex (49 48 60 61 51 50 62 63) AIR_INLET (1 1 3) simpleGrading (1 1 1)
hex (51 50 62 63 53 52 64 65) AIR_INLET (1 1 13) simpleGrading (1 1 1)
hex (53 52 64 65 55 54 66 67) AIR_INLET (1 1 10) simpleGrading (1 1 1)
hex (55 54 66 67 57 56 68 69) AIR_INLET (1 1 8) simpleGrading (1 1 1)
hex (57 56 68 69 59 58 70 71) AIR_INLET (1 1 3) simpleGrading (1 1 1)
hex (1 72 73 2 5 74 75 6) DIRTY_PLENUM (7 1 3) simpleGrading (1 1 1)
hex (5 74 75 6 9 76 77 10) DIRTY_PLENUM (7 1 13) simpleGrading (1 1 1)
hex (9 76 77 10 13 78 79 14) DIRTY_PLENUM (7 1 10) simpleGrading (1 1 1)
hex (13 78 79 14 17 80 81 18) DIRTY_PLENUM (7 1 8) simpleGrading (1 1 1)
hex (17 80 81 18 21 82 83 22) DIRTY_PLENUM (7 1 3) simpleGrading (1 1 1)
hex (2 73 84 24 6 75 85 26) DIRTY_PLENUM (7 3 3) simpleGrading (1 1 1)
hex (6 75 85 26 10 77 86 28) DIRTY_PLENUM (7 3 13) simpleGrading (1 1 1)
hex (10 77 86 28 14 79 87 30) DIRTY_PLENUM (7 3 10) simpleGrading (1 1 1)
hex (14 79 87 30 18 81 88 32) DIRTY_PLENUM (7 3 8) simpleGrading (1 1 1)
hex (18 81 88 32 22 83 89 34) DIRTY_PLENUM (7 3 3) simpleGrading (1 1 1)
hex (24 84 90 36 26 85 91 38) DIRTY_PLENUM (7 25 3) simpleGrading (1 1 1)
hex (26 85 91 38 28 86 92 40) DIRTY_PLENUM (7 25 13) simpleGrading (1 1 1)
hex (28 86 92 40 30 87 93 42) DIRTY_PLENUM (7 25 10) simpleGrading (1 1 1)
hex (30 87 93 42 32 88 94 44) DIRTY_PLENUM (7 25 8) simpleGrading (1 1 1)
hex (32 88 94 44 34 89 95 46) DIRTY_PLENUM (7 25 3) simpleGrading (1 1 1)
hex (36 90 96 48 38 91 97 50) DIRTY_PLENUM (7 3 3) simpleGrading (1 1 1)
hex (38 91 97 50 40 92 98 52) DIRTY_PLENUM (7 3 13) simpleGrading (1 1 1)
hex (40 92 98 52 42 93 99 54) DIRTY_PLENUM (7 3 10) simpleGrading (1 1 1)
hex (42 93 99 54 44 94 100 56) DIRTY_PLENUM (7 3 8) simpleGrading (1 1 1)
hex (44 94 100 56 46 95 101 58) DIRTY_PLENUM (7 3 3) simpleGrading (1 1 1)
hex (48 96 102 60 50 97 103 62) DIRTY_PLENUM (7 1 3) simpleGrading (1 1 1)
hex (50 97 103 62 52 98 104 64) DIRTY_PLENUM (7 1 13) simpleGrading (1 1 1)
hex (52 98 104 64 54 99 105 66) DIRTY_PLENUM (7 1 10) simpleGrading (1 1 1)
hex (54 99 105 66 56 100 106 68) DIRTY_PLENUM (7 1 8) simpleGrading (1 1 1)
hex (56 100 106 68 58 101 107 70) DIRTY_PLENUM (7 1 3) simpleGrading (1 1 1)
hex (72 108 109 73 74 110 111 75) STAGE_01 (2 1 3) simpleGrading (1 1 1)
hex (74 110 111 75 76 112 113 77) STAGE_01 (2 1 13) simpleGrading (1 1 1)
hex (76 112 113 77 78 114 115 79) STAGE_01 (2 1 10) simpleGrading (1 1 1)
hex (78 114 115 79 80 116 117 81) STAGE_01 (2 1 8) simpleGrading (1 1 1)
hex (80 116 117 81 82 118 119 83) STAGE_01 (2 1 3) simpleGrading (1 1 1)
hex (73 109 120 84 75 111 121 85) STAGE_01 (2 3 3) simpleGrading (1 1 1)
hex (75 111 121 85 77 113 122 86) STAGE_01 (2 3 13) simpleGrading (1 1 1)
hex (77 113 122 86 79 115 123 87) STAGE_01 (2 3 10) simpleGrading (1 1 1)
hex (79 115 123 87 81 117 124 88) STAGE_01 (2 3 8) simpleGrading (1 1 1)
hex (81 117 124 88 83 119 125 89) STAGE_01 (2 3 3) simpleGrading (1 1 1)
hex (84 120 126 90 85 121 127 91) STAGE_01 (2 25 3) simpleGrading (1 1 1)
hex (85 121 127 91 86 122 128 92) STAGE_01 (2 25 13) simpleGrading (1 1 1)
hex (86 122 128 92 87 123 129 93) STAGE_01 (2 25 10) simpleGrading (1 1 1)
hex (87 123 129 93 88 124 130 94) STAGE_01 (2 25 8) simpleGrading (1 1 1)
hex (88 124 130 94 89 125 131 95) STAGE_01 (2 25 3) simpleGrading (1 1 1)
hex (90 126 132 96 91 127 133 97) STAGE_01 (2 3 3) simpleGrading (1 1 1)
hex (91 127 133 97 92 128 134 98) STAGE_01 (2 3 13) simpleGrading (1 1 1)
hex (92 128 134 98 93 129 135 99) STAGE_01 (2 3 10) simpleGrading (1 1 1)
hex (93 129 135 99 94 130 136 100) STAGE_01 (2 3 8) simpleGrading (1 1 1)
hex (94 130 136 100 95 131 137 101) STAGE_01 (2 3 3) simpleGrading (1 1 1)
hex (96 132 138 102 97 133 139 103) STAGE_01 (2 1 3) simpleGrading (1 1 1)
hex (97 133 139 103 98 134 140 104) STAGE_01 (2 1 13) simpleGrading (1 1 1)
hex (98 134 140 104 99 135 141 105) STAGE_01 (2 1 10) simpleGrading (1 1 1)
hex (99 135 141 105 100 136 142 106) STAGE_01 (2 1 8) simpleGrading (1 1 1)
hex (100 136 142 106 101 137 143 107) STAGE_01 (2 1 3) simpleGrading (1 1 1)
hex (108 144 145 109 110 146 147 111) INTERSTAGE_01 (2 1 3) simpleGrading (1 1 1)
hex (110 146 147 111 112 148 149 113) INTERSTAGE_01 (2 1 13) simpleGrading (1 1 1)
hex (112 148 149 113 114 150 151 115) INTERSTAGE_01 (2 1 10) simpleGrading (1 1 1)
hex (114 150 151 115 116 152 153 117) INTERSTAGE_01 (2 1 8) simpleGrading (1 1 1)
hex (116 152 153 117 118 154 155 119) INTERSTAGE_01 (2 1 3) simpleGrading (1 1 1)
hex (109 145 156 120 111 147 157 121) INTERSTAGE_01 (2 3 3) simpleGrading (1 1 1)
hex (111 147 157 121 113 149 158 122) INTERSTAGE_01 (2 3 13) simpleGrading (1 1 1)
hex (113 149 158 122 115 151 159 123) INTERSTAGE_01 (2 3 10) simpleGrading (1 1 1)
hex (115 151 159 123 117 153 160 124) INTERSTAGE_01 (2 3 8) simpleGrading (1 1 1)
hex (117 153 160 124 119 155 161 125) INTERSTAGE_01 (2 3 3) simpleGrading (1 1 1)
hex (120 156 162 126 121 157 163 127) INTERSTAGE_01 (2 25 3) simpleGrading (1 1 1)
hex (121 157 163 127 122 158 164 128) INTERSTAGE_01 (2 25 13) simpleGrading (1 1 1)
hex (122 158 164 128 123 159 165 129) INTERSTAGE_01 (2 25 10) simpleGrading (1 1 1)
hex (123 159 165 129 124 160 166 130) INTERSTAGE_01 (2 25 8) simpleGrading (1 1 1)
hex (124 160 166 130 125 161 167 131) INTERSTAGE_01 (2 25 3) simpleGrading (1 1 1)
hex (126 162 168 132 127 163 169 133) INTERSTAGE_01 (2 3 3) simpleGrading (1 1 1)
hex (127 163 169 133 128 164 170 134) INTERSTAGE_01 (2 3 13) simpleGrading (1 1 1)
hex (128 164 170 134 129 165 171 135) INTERSTAGE_01 (2 3 10) simpleGrading (1 1 1)
hex (129 165 171 135 130 166 172 136) INTERSTAGE_01 (2 3 8) simpleGrading (1 1 1)
hex (130 166 172 136 131 167 173 137) INTERSTAGE_01 (2 3 3) simpleGrading (1 1 1)
hex (132 168 174 138 133 169 175 139) INTERSTAGE_01 (2 1 3) simpleGrading (1 1 1)
hex (133 169 175 139 134 170 176 140) INTERSTAGE_01 (2 1 13) simpleGrading (1 1 1)
hex (134 170 176 140 135 171 177 141) INTERSTAGE_01 (2 1 10) simpleGrading (1 1 1)
hex (135 171 177 141 136 172 178 142) INTERSTAGE_01 (2 1 8) simpleGrading (1 1 1)
hex (136 172 178 142 137 173 179 143) INTERSTAGE_01 (2 1 3) simpleGrading (1 1 1)
hex (144 180 181 145 146 182 183 147) STAGE_02 (2 1 3) simpleGrading (1 1 1)
hex (146 182 183 147 148 184 185 149) STAGE_02 (2 1 13) simpleGrading (1 1 1)
hex (148 184 185 149 150 186 187 151) STAGE_02 (2 1 10) simpleGrading (1 1 1)
hex (150 186 187 151 152 188 189 153) STAGE_02 (2 1 8) simpleGrading (1 1 1)
hex (152 188 189 153 154 190 191 155) STAGE_02 (2 1 3) simpleGrading (1 1 1)
hex (145 181 192 156 147 183 193 157) STAGE_02 (2 3 3) simpleGrading (1 1 1)
hex (147 183 193 157 149 185 194 158) STAGE_02 (2 3 13) simpleGrading (1 1 1)
hex (149 185 194 158 151 187 195 159) STAGE_02 (2 3 10) simpleGrading (1 1 1)
hex (151 187 195 159 153 189 196 160) STAGE_02 (2 3 8) simpleGrading (1 1 1)
hex (153 189 196 160 155 191 197 161) STAGE_02 (2 3 3) simpleGrading (1 1 1)
hex (156 192 198 162 157 193 199 163) STAGE_02 (2 25 3) simpleGrading (1 1 1)
hex (157 193 199 163 158 194 200 164) STAGE_02 (2 25 13) simpleGrading (1 1 1)
hex (158 194 200 164 159 195 201 165) STAGE_02 (2 25 10) simpleGrading (1 1 1)
hex (159 195 201 165 160 196 202 166) STAGE_02 (2 25 8) simpleGrading (1 1 1)
hex (160 196 202 166 161 197 203 167) STAGE_02 (2 25 3) simpleGrading (1 1 1)
hex (162 198 204 168 163 199 205 169) STAGE_02 (2 3 3) simpleGrading (1 1 1)
hex (163 199 205 169 164 200 206 170) STAGE_02 (2 3 13) simpleGrading (1 1 1)
hex (164 200 206 170 165 201 207 171) STAGE_02 (2 3 10) simpleGrading (1 1 1)
hex (165 201 207 171 166 202 208 172) STAGE_02 (2 3 8) simpleGrading (1 1 1)
hex (166 202 208 172 167 203 209 173) STAGE_02 (2 3 3) simpleGrading (1 1 1)
hex (168 204 210 174 169 205 211 175) STAGE_02 (2 1 3) simpleGrading (1 1 1)
hex (169 205 211 175 170 206 212 176) STAGE_02 (2 1 13) simpleGrading (1 1 1)
hex (170 206 212 176 171 207 213 177) STAGE_02 (2 1 10) simpleGrading (1 1 1)
hex (171 207 213 177 172 208 214 178) STAGE_02 (2 1 8) simpleGrading (1 1 1)
hex (172 208 214 178 173 209 215 179) STAGE_02 (2 1 3) simpleGrading (1 1 1)
hex (180 216 217 181 182 218 219 183) INTERSTAGE_02 (1 1 3) simpleGrading (1 1 1)
hex (182 218 219 183 184 220 221 185) INTERSTAGE_02 (1 1 13) simpleGrading (1 1 1)
hex (184 220 221 185 186 222 223 187) INTERSTAGE_02 (1 1 10) simpleGrading (1 1 1)
hex (186 222 223 187 188 224 225 189) INTERSTAGE_02 (1 1 8) simpleGrading (1 1 1)
hex (188 224 225 189 190 226 227 191) INTERSTAGE_02 (1 1 3) simpleGrading (1 1 1)
hex (181 217 228 192 183 219 229 193) INTERSTAGE_02 (1 3 3) simpleGrading (1 1 1)
hex (183 219 229 193 185 221 230 194) INTERSTAGE_02 (1 3 13) simpleGrading (1 1 1)
hex (185 221 230 194 187 223 231 195) INTERSTAGE_02 (1 3 10) simpleGrading (1 1 1)
hex (187 223 231 195 189 225 232 196) INTERSTAGE_02 (1 3 8) simpleGrading (1 1 1)
hex (189 225 232 196 191 227 233 197) INTERSTAGE_02 (1 3 3) simpleGrading (1 1 1)
hex (192 228 234 198 193 229 235 199) INTERSTAGE_02 (1 25 3) simpleGrading (1 1 1)
hex (193 229 235 199 194 230 236 200) INTERSTAGE_02 (1 25 13) simpleGrading (1 1 1)
hex (194 230 236 200 195 231 237 201) INTERSTAGE_02 (1 25 10) simpleGrading (1 1 1)
hex (195 231 237 201 196 232 238 202) INTERSTAGE_02 (1 25 8) simpleGrading (1 1 1)
hex (196 232 238 202 197 233 239 203) INTERSTAGE_02 (1 25 3) simpleGrading (1 1 1)
hex (198 234 240 204 199 235 241 205) INTERSTAGE_02 (1 3 3) simpleGrading (1 1 1)
hex (199 235 241 205 200 236 242 206) INTERSTAGE_02 (1 3 13) simpleGrading (1 1 1)
hex (200 236 242 206 201 237 243 207) INTERSTAGE_02 (1 3 10) simpleGrading (1 1 1)
hex (201 237 243 207 202 238 244 208) INTERSTAGE_02 (1 3 8) simpleGrading (1 1 1)
hex (202 238 244 208 203 239 245 209) INTERSTAGE_02 (1 3 3) simpleGrading (1 1 1)
hex (204 240 246 210 205 241 247 211) INTERSTAGE_02 (1 1 3) simpleGrading (1 1 1)
hex (205 241 247 211 206 242 248 212) INTERSTAGE_02 (1 1 13) simpleGrading (1 1 1)
hex (206 242 248 212 207 243 249 213) INTERSTAGE_02 (1 1 10) simpleGrading (1 1 1)
hex (207 243 249 213 208 244 250 214) INTERSTAGE_02 (1 1 8) simpleGrading (1 1 1)
hex (208 244 250 214 209 245 251 215) INTERSTAGE_02 (1 1 3) simpleGrading (1 1 1)
hex (216 252 253 217 218 254 255 219) INTERSTAGE_02 (2 1 3) simpleGrading (1 1 1)
hex (218 254 255 219 220 256 257 221) INTERSTAGE_02 (2 1 13) simpleGrading (1 1 1)
hex (220 256 257 221 222 258 259 223) INTERSTAGE_02 (2 1 10) simpleGrading (1 1 1)
hex (222 258 259 223 224 260 261 225) INTERSTAGE_02 (2 1 8) simpleGrading (1 1 1)
hex (224 260 261 225 226 262 263 227) INTERSTAGE_02 (2 1 3) simpleGrading (1 1 1)
hex (217 253 264 228 219 255 265 229) INTERSTAGE_02 (2 3 3) simpleGrading (1 1 1)
hex (219 255 265 229 221 257 266 230) INTERSTAGE_02 (2 3 13) simpleGrading (1 1 1)
hex (221 257 266 230 223 259 267 231) INTERSTAGE_02 (2 3 10) simpleGrading (1 1 1)
hex (223 259 267 231 225 261 268 232) INTERSTAGE_02 (2 3 8) simpleGrading (1 1 1)
hex (225 261 268 232 227 263 269 233) INTERSTAGE_02 (2 3 3) simpleGrading (1 1 1)
hex (228 264 270 234 229 265 271 235) INTERSTAGE_02 (2 25 3) simpleGrading (1 1 1)
hex (229 265 271 235 230 266 272 236) INTERSTAGE_02 (2 25 13) simpleGrading (1 1 1)
hex (230 266 272 236 231 267 273 237) INTERSTAGE_02 (2 25 10) simpleGrading (1 1 1)
hex (231 267 273 237 232 268 274 238) INTERSTAGE_02 (2 25 8) simpleGrading (1 1 1)
hex (232 268 274 238 233 269 275 239) INTERSTAGE_02 (2 25 3) simpleGrading (1 1 1)
hex (233 269 275 239 276 277 278 279) CLEAN_RISER (2 25 38) simpleGrading (1 1 1)
hex (276 277 278 279 280 281 282 283) CLEAN_RISER (2 25 13) simpleGrading (1 1 1)
hex (234 270 284 240 235 271 285 241) INTERSTAGE_02 (2 3 3) simpleGrading (1 1 1)
hex (235 271 285 241 236 272 286 242) INTERSTAGE_02 (2 3 13) simpleGrading (1 1 1)
hex (236 272 286 242 237 273 287 243) INTERSTAGE_02 (2 3 10) simpleGrading (1 1 1)
hex (237 273 287 243 238 274 288 244) INTERSTAGE_02 (2 3 8) simpleGrading (1 1 1)
hex (238 274 288 244 239 275 289 245) INTERSTAGE_02 (2 3 3) simpleGrading (1 1 1)
hex (240 284 290 246 241 285 291 247) INTERSTAGE_02 (2 1 3) simpleGrading (1 1 1)
hex (241 285 291 247 242 286 292 248) INTERSTAGE_02 (2 1 13) simpleGrading (1 1 1)
hex (242 286 292 248 243 287 293 249) INTERSTAGE_02 (2 1 10) simpleGrading (1 1 1)
hex (243 287 293 249 244 288 294 250) INTERSTAGE_02 (2 1 8) simpleGrading (1 1 1)
hex (244 288 294 250 245 289 295 251) INTERSTAGE_02 (2 1 3) simpleGrading (1 1 1)
hex (252 296 297 253 254 298 299 255) STAGE_03 (1 1 3) simpleGrading (1 1 1)
hex (254 298 299 255 256 300 301 257) STAGE_03 (1 1 13) simpleGrading (1 1 1)
hex (256 300 301 257 258 302 303 259) STAGE_03 (1 1 10) simpleGrading (1 1 1)
hex (258 302 303 259 260 304 305 261) STAGE_03 (1 1 8) simpleGrading (1 1 1)
hex (260 304 305 261 262 306 307 263) STAGE_03 (1 1 3) simpleGrading (1 1 1)
hex (253 297 308 264 255 299 309 265) STAGE_03 (1 3 3) simpleGrading (1 1 1)
hex (255 299 309 265 257 301 310 266) STAGE_03 (1 3 13) simpleGrading (1 1 1)
hex (257 301 310 266 259 303 311 267) STAGE_03 (1 3 10) simpleGrading (1 1 1)
hex (259 303 311 267 261 305 312 268) STAGE_03 (1 3 8) simpleGrading (1 1 1)
hex (261 305 312 268 263 307 313 269) STAGE_03 (1 3 3) simpleGrading (1 1 1)
hex (264 308 314 270 265 309 315 271) STAGE_03 (1 25 3) simpleGrading (1 1 1)
hex (265 309 315 271 266 310 316 272) STAGE_03 (1 25 13) simpleGrading (1 1 1)
hex (266 310 316 272 267 311 317 273) STAGE_03 (1 25 10) simpleGrading (1 1 1)
hex (267 311 317 273 268 312 318 274) STAGE_03 (1 25 8) simpleGrading (1 1 1)
hex (268 312 318 274 269 313 319 275) STAGE_03 (1 25 3) simpleGrading (1 1 1)
hex (269 313 319 275 277 320 321 278) CLEAN_RISER (1 25 38) simpleGrading (1 1 1)
hex (277 320 321 278 281 322 323 282) CLEAN_RISER (1 25 13) simpleGrading (1 1 1)
hex (270 314 324 284 271 315 325 285) STAGE_03 (1 3 3) simpleGrading (1 1 1)
hex (271 315 325 285 272 316 326 286) STAGE_03 (1 3 13) simpleGrading (1 1 1)
hex (272 316 326 286 273 317 327 287) STAGE_03 (1 3 10) simpleGrading (1 1 1)
hex (273 317 327 287 274 318 328 288) STAGE_03 (1 3 8) simpleGrading (1 1 1)
hex (274 318 328 288 275 319 329 289) STAGE_03 (1 3 3) simpleGrading (1 1 1)
hex (284 324 330 290 285 325 331 291) STAGE_03 (1 1 3) simpleGrading (1 1 1)
hex (285 325 331 291 286 326 332 292) STAGE_03 (1 1 13) simpleGrading (1 1 1)
hex (286 326 332 292 287 327 333 293) STAGE_03 (1 1 10) simpleGrading (1 1 1)
hex (287 327 333 293 288 328 334 294) STAGE_03 (1 1 8) simpleGrading (1 1 1)
hex (288 328 334 294 289 329 335 295) STAGE_03 (1 1 3) simpleGrading (1 1 1)
hex (296 336 337 297 298 338 339 299) STAGE_03 (1 1 3) simpleGrading (1 1 1)
hex (298 338 339 299 300 340 341 301) STAGE_03 (1 1 13) simpleGrading (1 1 1)
hex (300 340 341 301 302 342 343 303) STAGE_03 (1 1 10) simpleGrading (1 1 1)
hex (302 342 343 303 304 344 345 305) STAGE_03 (1 1 8) simpleGrading (1 1 1)
hex (304 344 345 305 306 346 347 307) STAGE_03 (1 1 3) simpleGrading (1 1 1)
hex (297 337 348 308 299 339 349 309) STAGE_03 (1 3 3) simpleGrading (1 1 1)
hex (299 339 349 309 301 341 350 310) STAGE_03 (1 3 13) simpleGrading (1 1 1)
hex (301 341 350 310 303 343 351 311) STAGE_03 (1 3 10) simpleGrading (1 1 1)
hex (303 343 351 311 305 345 352 312) STAGE_03 (1 3 8) simpleGrading (1 1 1)
hex (305 345 352 312 307 347 353 313) STAGE_03 (1 3 3) simpleGrading (1 1 1)
hex (308 348 354 314 309 349 355 315) STAGE_03 (1 25 3) simpleGrading (1 1 1)
hex (309 349 355 315 310 350 356 316) STAGE_03 (1 25 13) simpleGrading (1 1 1)
hex (310 350 356 316 311 351 357 317) STAGE_03 (1 25 10) simpleGrading (1 1 1)
hex (311 351 357 317 312 352 358 318) STAGE_03 (1 25 8) simpleGrading (1 1 1)
hex (312 352 358 318 313 353 359 319) STAGE_03 (1 25 3) simpleGrading (1 1 1)
hex (313 353 359 319 320 360 361 321) CLEAN_RISER (1 25 38) simpleGrading (1 1 1)
hex (320 360 361 321 322 362 363 323) CLEAN_RISER (1 25 13) simpleGrading (1 1 1)
hex (314 354 364 324 315 355 365 325) STAGE_03 (1 3 3) simpleGrading (1 1 1)
hex (315 355 365 325 316 356 366 326) STAGE_03 (1 3 13) simpleGrading (1 1 1)
hex (316 356 366 326 317 357 367 327) STAGE_03 (1 3 10) simpleGrading (1 1 1)
hex (317 357 367 327 318 358 368 328) STAGE_03 (1 3 8) simpleGrading (1 1 1)
hex (318 358 368 328 319 359 369 329) STAGE_03 (1 3 3) simpleGrading (1 1 1)
hex (324 364 370 330 325 365 371 331) STAGE_03 (1 1 3) simpleGrading (1 1 1)
hex (325 365 371 331 326 366 372 332) STAGE_03 (1 1 13) simpleGrading (1 1 1)
hex (326 366 372 332 327 367 373 333) STAGE_03 (1 1 10) simpleGrading (1 1 1)
hex (327 367 373 333 328 368 374 334) STAGE_03 (1 1 8) simpleGrading (1 1 1)
hex (328 368 374 334 329 369 375 335) STAGE_03 (1 1 3) simpleGrading (1 1 1)
hex (336 376 377 337 338 378 379 339) CLEAN_PLENUM (9 1 3) simpleGrading (1 1 1)
hex (338 378 379 339 340 380 381 341) CLEAN_PLENUM (9 1 13) simpleGrading (1 1 1)
hex (340 380 381 341 342 382 383 343) CLEAN_PLENUM (9 1 10) simpleGrading (1 1 1)
hex (342 382 383 343 344 384 385 345) CLEAN_PLENUM (9 1 8) simpleGrading (1 1 1)
hex (344 384 385 345 346 386 387 347) CLEAN_PLENUM (9 1 3) simpleGrading (1 1 1)
hex (337 377 388 348 339 379 389 349) CLEAN_PLENUM (9 3 3) simpleGrading (1 1 1)
hex (339 379 389 349 341 381 390 350) CLEAN_PLENUM (9 3 13) simpleGrading (1 1 1)
hex (341 381 390 350 343 383 391 351) CLEAN_PLENUM (9 3 10) simpleGrading (1 1 1)
hex (343 383 391 351 345 385 392 352) CLEAN_PLENUM (9 3 8) simpleGrading (1 1 1)
hex (345 385 392 352 347 387 393 353) CLEAN_PLENUM (9 3 3) simpleGrading (1 1 1)
hex (348 388 394 354 349 389 395 355) CLEAN_PLENUM (9 25 3) simpleGrading (1 1 1)
hex (349 389 395 355 350 390 396 356) CLEAN_PLENUM (9 25 13) simpleGrading (1 1 1)
hex (350 390 396 356 351 391 397 357) CLEAN_PLENUM (9 25 10) simpleGrading (1 1 1)
hex (351 391 397 357 352 392 398 358) CLEAN_PLENUM (9 25 8) simpleGrading (1 1 1)
hex (352 392 398 358 353 393 399 359) CLEAN_PLENUM (9 25 3) simpleGrading (1 1 1)
hex (353 393 399 359 360 400 401 361) CLEAN_RISER (9 25 38) simpleGrading (1 1 1)
hex (360 400 401 361 362 402 403 363) CLEAN_RISER (9 25 13) simpleGrading (1 1 1)
hex (354 394 404 364 355 395 405 365) CLEAN_PLENUM (9 3 3) simpleGrading (1 1 1)
hex (355 395 405 365 356 396 406 366) CLEAN_PLENUM (9 3 13) simpleGrading (1 1 1)
hex (356 396 406 366 357 397 407 367) CLEAN_PLENUM (9 3 10) simpleGrading (1 1 1)
hex (357 397 407 367 358 398 408 368) CLEAN_PLENUM (9 3 8) simpleGrading (1 1 1)
hex (358 398 408 368 359 399 409 369) CLEAN_PLENUM (9 3 3) simpleGrading (1 1 1)
hex (364 404 410 370 365 405 411 371) CLEAN_PLENUM (9 1 3) simpleGrading (1 1 1)
hex (365 405 411 371 366 406 412 372) CLEAN_PLENUM (9 1 13) simpleGrading (1 1 1)
hex (366 406 412 372 367 407 413 373) CLEAN_PLENUM (9 1 10) simpleGrading (1 1 1)
hex (367 407 413 373 368 408 414 374) CLEAN_PLENUM (9 1 8) simpleGrading (1 1 1)
hex (368 408 414 374 369 409 415 375) CLEAN_PLENUM (9 1 3) simpleGrading (1 1 1)
hex (390 416 417 396 391 418 419 397) TURN_STEP_01 (5 25 10) simpleGrading (1 1 1)
hex (391 418 419 397 392 420 421 398) TURN_STEP_01 (5 25 8) simpleGrading (1 1 1)
hex (392 420 421 398 393 422 423 399) TURN_STEP_01 (5 25 3) simpleGrading (1 1 1)
hex (393 422 423 399 400 424 425 401) CLEAN_RISER (5 25 38) simpleGrading (1 1 1)
hex (400 424 425 401 402 426 427 403) CLEAN_RISER (5 25 13) simpleGrading (1 1 1)
hex (418 428 429 419 420 430 431 421) TURN_STEP_02 (5 25 8) simpleGrading (1 1 1)
hex (420 430 431 421 422 432 433 423) TURN_STEP_02 (5 25 3) simpleGrading (1 1 1)
hex (422 432 433 423 424 434 435 425) CLEAN_RISER (5 25 38) simpleGrading (1 1 1)
hex (424 434 435 425 426 436 437 427) CLEAN_RISER (5 25 13) simpleGrading (1 1 1)
hex (434 438 439 435 436 440 441 437) AIR_OUTLET (1 25 13) simpleGrading (1 1 1)
);
edges ();
boundary
(
AIR_INLET
{
 type patch;
 faces
(
(0 4 7 3)
(4 8 11 7)
(8 12 15 11)
(12 16 19 15)
(16 20 23 19)
(3 7 27 25)
(7 11 29 27)
(11 15 31 29)
(15 19 33 31)
(19 23 35 33)
(25 27 39 37)
(27 29 41 39)
(29 31 43 41)
(31 33 45 43)
(33 35 47 45)
(37 39 51 49)
(39 41 53 51)
(41 43 55 53)
(43 45 57 55)
(45 47 59 57)
(49 51 63 61)
(51 53 65 63)
(53 55 67 65)
(55 57 69 67)
(57 59 71 69)
);
}
AIR_OUTLET
{
 type patch;
 faces
(
(438 439 441 440)
);
}
WALLS
{
 type wall;
 faces
(
(0 1 5 4)
(0 3 2 1)
(4 5 9 8)
(8 9 13 12)
(12 13 17 16)
(16 17 21 20)
(20 21 22 23)
(3 25 24 2)
(23 22 34 35)
(25 37 36 24)
(35 34 46 47)
(37 49 48 36)
(47 46 58 59)
(61 63 62 60)
(49 61 60 48)
(63 65 64 62)
(65 67 66 64)
(67 69 68 66)
(69 71 70 68)
(59 58 70 71)
(1 72 74 5)
(1 2 73 72)
(5 74 76 9)
(9 76 78 13)
(13 78 80 17)
(17 80 82 21)
(21 82 83 22)
(2 24 84 73)
(22 83 89 34)
(24 36 90 84)
(34 89 95 46)
(36 48 96 90)
(46 95 101 58)
(60 62 103 102)
(48 60 102 96)
(62 64 104 103)
(64 66 105 104)
(66 68 106 105)
(68 70 107 106)
(58 101 107 70)
(72 108 110 74)
(72 73 109 108)
(74 110 112 76)
(76 112 114 78)
(78 114 116 80)
(80 116 118 82)
(82 118 119 83)
(73 84 120 109)
(83 119 125 89)
(84 90 126 120)
(89 125 131 95)
(90 96 132 126)
(95 131 137 101)
(102 103 139 138)
(96 102 138 132)
(103 104 140 139)
(104 105 141 140)
(105 106 142 141)
(106 107 143 142)
(101 137 143 107)
(108 144 146 110)
(108 109 145 144)
(110 146 148 112)
(112 148 150 114)
(114 150 152 116)
(116 152 154 118)
(118 154 155 119)
(109 120 156 145)
(119 155 161 125)
(120 126 162 156)
(125 161 167 131)
(126 132 168 162)
(131 167 173 137)
(138 139 175 174)
(132 138 174 168)
(139 140 176 175)
(140 141 177 176)
(141 142 178 177)
(142 143 179 178)
(137 173 179 143)
(144 180 182 146)
(144 145 181 180)
(146 182 184 148)
(148 184 186 150)
(150 186 188 152)
(152 188 190 154)
(154 190 191 155)
(145 156 192 181)
(155 191 197 161)
(156 162 198 192)
(161 197 203 167)
(162 168 204 198)
(167 203 209 173)
(174 175 211 210)
(168 174 210 204)
(175 176 212 211)
(176 177 213 212)
(177 178 214 213)
(178 179 215 214)
(173 209 215 179)
(180 216 218 182)
(180 181 217 216)
(182 218 220 184)
(184 220 222 186)
(186 222 224 188)
(188 224 226 190)
(190 226 227 191)
(181 192 228 217)
(191 227 233 197)
(192 198 234 228)
(197 233 239 203)
(198 204 240 234)
(203 239 245 209)
(210 211 247 246)
(204 210 246 240)
(211 212 248 247)
(212 213 249 248)
(213 214 250 249)
(214 215 251 250)
(209 245 251 215)
(216 252 254 218)
(216 217 253 252)
(218 254 256 220)
(220 256 258 222)
(222 258 260 224)
(224 260 262 226)
(226 262 263 227)
(217 228 264 253)
(227 263 269 233)
(228 234 270 264)
(233 276 279 239)
(233 269 277 276)
(239 279 278 275)
(276 280 283 279)
(276 277 281 280)
(279 283 282 278)
(280 281 282 283)
(234 240 284 270)
(239 275 289 245)
(246 247 291 290)
(240 246 290 284)
(247 248 292 291)
(248 249 293 292)
(249 250 294 293)
(250 251 295 294)
(245 289 295 251)
(252 296 298 254)
(252 253 297 296)
(254 298 300 256)
(256 300 302 258)
(258 302 304 260)
(260 304 306 262)
(262 306 307 263)
(253 264 308 297)
(263 307 313 269)
(264 270 314 308)
(269 313 320 277)
(275 278 321 319)
(277 320 322 281)
(278 282 323 321)
(281 322 323 282)
(270 284 324 314)
(275 319 329 289)
(290 291 331 330)
(284 290 330 324)
(291 292 332 331)
(292 293 333 332)
(293 294 334 333)
(294 295 335 334)
(289 329 335 295)
(296 336 338 298)
(296 297 337 336)
(298 338 340 300)
(300 340 342 302)
(302 342 344 304)
(304 344 346 306)
(306 346 347 307)
(297 308 348 337)
(307 347 353 313)
(308 314 354 348)
(313 353 360 320)
(319 321 361 359)
(320 360 362 322)
(321 323 363 361)
(322 362 363 323)
(314 324 364 354)
(319 359 369 329)
(330 331 371 370)
(324 330 370 364)
(331 332 372 371)
(332 333 373 372)
(333 334 374 373)
(334 335 375 374)
(329 369 375 335)
(376 377 379 378)
(336 376 378 338)
(336 337 377 376)
(378 379 381 380)
(338 378 380 340)
(380 381 383 382)
(340 380 382 342)
(382 383 385 384)
(342 382 384 344)
(384 385 387 386)
(344 384 386 346)
(346 386 387 347)
(377 388 389 379)
(337 348 388 377)
(379 389 390 381)
(381 390 391 383)
(383 391 392 385)
(385 392 393 387)
(347 387 393 353)
(388 394 395 389)
(348 354 394 388)
(389 395 396 390)
(353 393 400 360)
(359 361 401 399)
(360 400 402 362)
(361 363 403 401)
(362 402 403 363)
(394 404 405 395)
(354 364 404 394)
(395 405 406 396)
(396 406 407 397)
(397 407 408 398)
(398 408 409 399)
(359 399 409 369)
(404 410 411 405)
(370 371 411 410)
(364 370 410 404)
(405 411 412 406)
(371 372 412 411)
(406 412 413 407)
(372 373 413 412)
(407 413 414 408)
(373 374 414 413)
(408 414 415 409)
(374 375 415 414)
(369 409 415 375)
(416 417 419 418)
(390 416 418 391)
(396 397 419 417)
(390 396 417 416)
(391 418 420 392)
(397 398 421 419)
(392 420 422 393)
(398 399 423 421)
(393 422 424 400)
(399 401 425 423)
(400 424 426 402)
(401 403 427 425)
(402 426 427 403)
(428 429 431 430)
(418 428 430 420)
(419 421 431 429)
(418 419 429 428)
(430 431 433 432)
(420 430 432 422)
(421 423 433 431)
(432 433 435 434)
(422 432 434 424)
(423 425 435 433)
(424 434 436 426)
(425 427 437 435)
(426 436 437 427)
(434 438 440 436)
(435 437 441 439)
(434 435 439 438)
(436 440 441 437)
);
}
);
mergePatchPairs ();
