cfd/FILTER_H13/CASE_M/constant/momentumTransport
FoamFile { version 2.0; format ascii; class dictionary; object momentumTransport; }
simulationType RAS;
RAS { model kEpsilon; turbulence on; viscosityModel Newtonian; }
