cfd/FILTER_H13/CASE_M/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.9 0 0);

boundaryField
{
    AIR_INLET
    {
        type            pressureInletOutletVelocity;
        tangentialVelocity uniform (0 0 0);
        value           uniform (0.9 0 0);
    }
    AIR_OUTLET
    {
        type            pressureInletOutletVelocity;
        tangentialVelocity uniform (0 0 0);
        value           uniform (2.8 0 0);
    }
    WALLS
    {
        type            noSlip;
    }
    FILTER_UPSTREAM
    {
        type            cyclic;
    }
    FILTER_DOWNSTREAM
    {
        type            cyclic;
    }
    FILTER_FRAME_UPSTREAM
    {
        type            noSlip;
    }
    FILTER_FRAME_DOWNSTREAM
    {
        type            noSlip;
    }
}


// ************************************************************************* //
