cfd/FILTER_H13/CASE_M/system/fvSolution.tight
FoamFile { version 2.0; format ascii; class dictionary; object fvSolution; }
solvers
{
    p { solver GAMG; tolerance 1e-10; relTol 0; smoother GaussSeidel; }
    pcorr { solver GAMG; tolerance 1e-10; relTol 0; smoother GaussSeidel; }
    "(U|k|epsilon)"
    { solver smoothSolver; smoother symGaussSeidel; tolerance 1e-10; relTol 0; }
}
SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent yes;
    residualControl { p 1e-5; U 1e-6; "(k|epsilon)" 1e-6; }
}
relaxationFactors
{
    // Inherited from V00 best settings (SIMPLEC run, iterations 3001-6000).
    fields { p 0.3; }
    equations { U 0.7; k 0.5; epsilon 0.5; }
}
